{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/NouhailaOULAARIF/recipe-graph-assistant/blob/main/Neo4j_Chat.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "arcDVq0PiCKA",
        "outputId": "bfe3043b-84ae-4120-ef69-f3c0b98e05d7"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Requirement already satisfied: google-generativeai in /usr/local/lib/python3.10/dist-packages (0.3.2)\n",
            "Requirement already satisfied: google-ai-generativelanguage==0.4.0 in /usr/local/lib/python3.10/dist-packages (from google-generativeai) (0.4.0)\n",
            "Requirement already satisfied: google-auth in /usr/local/lib/python3.10/dist-packages (from google-generativeai) (2.27.0)\n",
            "Requirement already satisfied: google-api-core in /usr/local/lib/python3.10/dist-packages (from google-generativeai) (2.11.1)\n",
            "Requirement already satisfied: typing-extensions in /usr/local/lib/python3.10/dist-packages (from google-generativeai) (4.10.0)\n",
            "Requirement already satisfied: protobuf in /usr/local/lib/python3.10/dist-packages (from google-generativeai) (3.20.3)\n",
            "Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from google-generativeai) (4.66.2)\n",
            "Requirement already satisfied: proto-plus<2.0.0dev,>=1.22.3 in /usr/local/lib/python3.10/dist-packages (from google-ai-generativelanguage==0.4.0->google-generativeai) (1.23.0)\n",
            "Requirement already satisfied: googleapis-common-protos<2.0.dev0,>=1.56.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai) (1.63.0)\n",
            "Requirement already satisfied: requests<3.0.0.dev0,>=2.18.0 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai) (2.31.0)\n",
            "Requirement already satisfied: cachetools<6.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from google-auth->google-generativeai) (5.3.3)\n",
            "Requirement already satisfied: pyasn1-modules>=0.2.1 in /usr/local/lib/python3.10/dist-packages (from google-auth->google-generativeai) (0.3.0)\n",
            "Requirement already satisfied: rsa<5,>=3.1.4 in /usr/local/lib/python3.10/dist-packages (from google-auth->google-generativeai) (4.9)\n",
            "Requirement already satisfied: grpcio<2.0dev,>=1.33.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai) (1.62.1)\n",
            "Requirement already satisfied: grpcio-status<2.0.dev0,>=1.33.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai) (1.48.2)\n",
            "Requirement already satisfied: pyasn1<0.6.0,>=0.4.6 in /usr/local/lib/python3.10/dist-packages (from pyasn1-modules>=0.2.1->google-auth->google-generativeai) (0.5.1)\n",
            "Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai) (3.3.2)\n",
            "Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai) (3.6)\n",
            "Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai) (2.0.7)\n",
            "Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai) (2024.2.2)\n"
          ]
        }
      ],
      "source": [
        "!pip install google-generativeai\n",
        "!pip install -q neo4j-driver\n",
        "!pip install -q gradio"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "qesCNLOJiiNc"
      },
      "outputs": [],
      "source": [
        "import google.generativeai as gemini\n",
        "import base64\n",
        "import json\n",
        "import gradio as gr\n",
        "from neo4j import GraphDatabase\n",
        "import re"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "Q_LxKHmUim1w"
      },
      "outputs": [],
      "source": [
        "gemini.configure(api_key= \"API_KEY\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "fRKn0oFDiqFV"
      },
      "outputs": [],
      "source": [
        "def get_answer(input):\n",
        "\n",
        "    defaults = {\n",
        "  'model': 'models/text-bison-001',\n",
        "  'temperature': 0.7,\n",
        "  'candidate_count': 1,\n",
        "  'top_k': 40,\n",
        "  'top_p': 0.95,\n",
        "  'max_output_tokens': 1024,\n",
        "  'stop_sequences': [],\n",
        "  'safety_settings': [{\"category\":\"HARM_CATEGORY_DEROGATORY\",\"threshold\":1},{\"category\":\"HARM_CATEGORY_TOXICITY\",\"threshold\":1},{\"category\":\"HARM_CATEGORY_VIOLENCE\",\"threshold\":2},{\"category\":\"HARM_CATEGORY_SEXUAL\",\"threshold\":2},{\"category\":\"HARM_CATEGORY_MEDICAL\",\"threshold\":2},{\"category\":\"HARM_CATEGORY_DANGEROUS\",\"threshold\":2}],\n",
        "    }\n",
        "\n",
        "    prompt = f\"\"\"You are an expert in converting English questions to Neo4j Cypher Graph code! The Graph has following Node Labels - Recette , Étape , Ingrédient ,and the Recette Node label has the following properties - title, link, source, the Étape Node label has the following properties - Id and description, the  Ingrédient Node label has the following properties - nom, mesure and the Graph has the following Relationship types PREPARED_WITH_STEPS, CONTIENT!\n",
        "\n",
        "    the relationships PREPARED_WITH_STEPS start from Recette Nodes to the Étape Nodes not the other way around and relationships CONTIENT start from Recette Nodes to the Ingrédient Nodes not the other way around.\n",
        "\n",
        "    For example,\n",
        "    Example 1 - Could you provide the ingredients for Carrot Bread, the Cypher command will be something like this\n",
        "    ``` MATCH (Recette:Recette)-[:CONTIENT]->(Ingrédient:Ingrédient)\n",
        "    WHERE Recette.title= 'Carrot Bread'\n",
        "    RETURN Ingrédient.nom, Ingrédient.mesure\n",
        "    ```\n",
        "\n",
        "    Example 2 - How can I prepare the recipe for No-Bake Nut Cookies.\n",
        "    ```\n",
        "     MATCH (recette:Recette)-[:PREPARED_WITH_STEPS]->(etape:Étape)\n",
        "    MATCH (recette)-[:CONTIENT]->(ingredient:Ingrédient)\n",
        "    WHERE recette.title = 'No Bake Nut Cookies'\n",
        "    WITH recette.title AS TitreRecette,\n",
        "        COLLECT(DISTINCT etape.description) AS DescriptionsÉtapes,\n",
        "        COLLECT(DISTINCT ingredient) AS Ingrédients\n",
        "    RETURN TitreRecette,\n",
        "          DescriptionsÉtapes,\n",
        "          REDUCE(acc = \"\", i IN Ingrédients | acc + i.nom + \" \" + i.mesure + \", \") AS Ingrédients\n",
        "\n",
        "    ```\n",
        "    Example 3 - How can I prepare the recipe for Carrot Bread.\n",
        "    ```\n",
        "    MATCH (recette:Recette)-[:PREPARED_WITH_STEPS]->(etape:Étape)\n",
        "    MATCH (recette)-[:CONTIENT]->(ingredient:Ingrédient)\n",
        "    WHERE recette.title = 'Carrot Bread'\n",
        "    WITH recette.title AS TitreRecette,\n",
        "        COLLECT(DISTINCT etape.description) AS DescriptionsÉtapes,\n",
        "        COLLECT(DISTINCT ingredient) AS Ingrédients\n",
        "    RETURN TitreRecette,\n",
        "          DescriptionsÉtapes,\n",
        "          REDUCE(acc = \"\", i IN Ingrédients | acc + i.nom + \" \" + i.mesure + \", \") AS Ingrédients\n",
        "\n",
        "    ```\n",
        "\n",
        "    Example 4 - Provide the steps of the recipe No-Bake Nut Cookies.\n",
        "    ```\n",
        "    MATCH (recette:Recette)-[:PREPARED_WITH_STEPS]->(etape:Étape)\n",
        "    WHERE recette.title = \"No Bake Nut Cookies\"\n",
        "    RETURN etape.description AS DescriptionÉtape\n",
        "    ORDER BY etape.Id\n",
        "\n",
        "    ```\n",
        "    Example 5 - can you give me recipes with flour as ingredient.\n",
        "    ```\n",
        "    MATCH (n:Recette)-[:CONTIENT]->(i:Ingrédient) WHERE i.nom=\"flour\" RETURN DISTINCT n.title\n",
        "\n",
        "    ```\n",
        "    Example 6 - can you give me recipes with flour and sugar as ingredients.\n",
        "    ```\n",
        "    MATCH (r:Recette)-[:CONTIENT]->(i:Ingrédient)\n",
        "    WHERE i.nom IN ['flour', 'sugar']\n",
        "    WITH r, COUNT(i) AS ingredientsUsed\n",
        "    RETURN r.title\n",
        "\n",
        "    ```\n",
        "     Example 7 - could you provide me the link of the recipe French Toast\n",
        "    ```\n",
        "     MATCH (r:Recette) WHERE r.title = \"French Toast\" RETURN r.link\n",
        "\n",
        "    ```\n",
        "    Dont include ``` and \\n in the output\n",
        "\n",
        "    {input}\"\"\"\n",
        "    model = gemini.GenerativeModel('gemini-pro')\n",
        "    response = model.generate_content(prompt)\n",
        "    return response.text"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 35
        },
        "id": "RRHfjlBkixgC",
        "outputId": "16d6ee7d-6d25-40b3-8615-8954136cbb3a"
      },
      "outputs": [
        {
          "data": {
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            },
            "text/plain": [
              "\"MATCH (Recette:Recette)-[:CONTIENT]->(Ingrédient:Ingrédient)\\nWHERE Recette.title= 'Carrot Bread'\\nRETURN Ingrédient.nom, Ingrédient.mesure\""
            ]
          },
          "execution_count": 24,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "get_answer(\"Could you provide the ingredients for Carrot Bread?\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "b2NPDdYA3ZGU"
      },
      "outputs": [],
      "source": [
        "driver = GraphDatabase.driver(\"bolt://VOTRE_ADRESSE_IP:7687\", auth=(\"neo4j\", \"VOTRE_MOT_DE_PASSE\"))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "dZRIvyCa3akI"
      },
      "outputs": [],
      "source": [
        "def extract_query_and_return_key(input_query_result):\n",
        "    slash_n_pattern = r'[ \\n]+'\n",
        "    ret_pattern = r'RETURN\\s+(.*)'\n",
        "    replacement = ' '\n",
        "\n",
        "    cleaned_query = re.sub(slash_n_pattern, replacement, input_query_result)\n",
        "    if cleaned_query:\n",
        "        match = re.search(ret_pattern, cleaned_query)\n",
        "        if match:\n",
        "            extracted_string = match.group(1)\n",
        "        else:\n",
        "            extracted_string = \"\"\n",
        "    return cleaned_query, extracted_string"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 52
        },
        "id": "O7dEH9pT3jfz",
        "outputId": "65e20fed-f42c-404b-b339-74e006596672"
      },
      "outputs": [
        {
          "data": {
            "text/plain": [
              "(\"MATCH (Recette:Recette)-[:CONTIENT]->(Ingrédient:Ingrédient) WHERE Recette.title= 'Carrot Bread' RETURN Ingrédient.nom, Ingrédient.mesure\",\n",
              " 'Ingrédient.nom, Ingrédient.mesure')"
            ]
          },
          "execution_count": 27,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "extract_query_and_return_key(get_answer(\"Could you provide the ingredients for Carrot Bread ?\"))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "3Yf85Alf3oj-"
      },
      "outputs": [],
      "source": [
        "def format_names_with_ampersand(names):\n",
        "    if len(names) == 0:\n",
        "        return \"\"\n",
        "    elif len(names) == 1:\n",
        "        return names[0]\n",
        "    else:\n",
        "        formatted_names = \", \".join(names[:-1]) + \" & \" + names[-1]\n",
        "        return formatted_names"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 35
        },
        "id": "vOJvXLAJ3ufR",
        "outputId": "6dabfe3f-4440-4e04-e2ca-1d3f9080e072"
      },
      "outputs": [
        {
          "data": {
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            },
            "text/plain": [
              "'Carrot Bread & amal'"
            ]
          },
          "execution_count": 29,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "format_names_with_ampersand([\"Carrot Bread\",\"amal\"])"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "lxEPPXWw3yNL"
      },
      "outputs": [],
      "source": [
        "def run_cypher_on_neo4j(inp_query):\n",
        "    out_list = []\n",
        "    with driver.session() as session:\n",
        "        result = session.run(inp_query)\n",
        "        for record in result:\n",
        "            values = [str(value) for value in record.values()]\n",
        "            out_list.append(\", \".join(values))\n",
        "    driver.close()\n",
        "    return \" & \".join(out_list)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 53
        },
        "id": "ZR_6mHsI33i7",
        "outputId": "8d194fc3-8dbe-4645-e0c2-8b6093b55187"
      },
      "outputs": [
        {
          "data": {
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            },
            "text/plain": [
              "' grated American cheese, 1 c. & ketchup, 1 Tbsp. & dry mustard, 1 tsp. & salt or to taste, 1 1/2 tsp. & finely chopped onion, 4 Tbsp. & ground chuck, 1 1/2 lb. & cracker crumbs, 1 c. & egg, 1 & evaporated milk, 1/2 c.'"
            ]
          },
          "execution_count": 31,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "query_l, _ = extract_query_and_return_key(get_answer(\"Could you provide the ingredients for Cheeseburger Loaf?\"))\n",
        "run_cypher_on_neo4j(query_l)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "yZS8qJIixJin"
      },
      "outputs": [],
      "source": [
        "def generate_and_exec_cypher(input_query):\n",
        "    gen_query, _ = extract_query_and_return_key(get_answer(input_query))\n",
        "    return run_cypher_on_neo4j(gen_query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "3EPwMAQbxZIm"
      },
      "outputs": [],
      "source": [
        "def chatbot(input, history=[]):\n",
        "    output = str(generate_and_exec_cypher(input))\n",
        "    history.append((input, output))\n",
        "    return history, history"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "background_save": true,
          "base_uri": "https://localhost:8080/",
          "height": 680
        },
        "id": "3-gU7XvPxc3F",
        "outputId": "2514b07d-7af9-4a3a-988d-a3eb77844a5b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Setting queue=True in a Colab notebook requires sharing enabled. Setting `share=True` (you can turn this off by setting `share=False` in `launch()` explicitly).\n",
            "\n",
            "Colab notebook detected. This cell will run indefinitely so that you can see errors and logs. To turn off, set debug=False in launch().\n",
            "Running on public URL: https://a89d96ce934dd762ed.gradio.live\n",
            "\n",
            "This share link expires in 72 hours. For free permanent hosting and GPU upgrades, run `gradio deploy` from Terminal to deploy to Spaces (https://huggingface.co/spaces)\n"
          ]
        },
        {
          "data": {
            "text/html": [
              "<div><iframe src=\"https://a89d96ce934dd762ed.gradio.live\" width=\"100%\" height=\"500\" allow=\"autoplay; camera; microphone; clipboard-read; clipboard-write;\" frameborder=\"0\" allowfullscreen></iframe></div>"
            ],
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ]
          },
          "metadata": {},
          "output_type": "display_data"
        },
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "<ipython-input-30-bcfdde099f6c>:3: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
            "  with driver.session() as session:\n"
          ]
        }
      ],
      "source": [
        "gr.Interface(fn = chatbot,\n",
        "             inputs = [\"text\",'state'],\n",
        "             outputs = [\"chatbot\",'state']).launch(debug = True)"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": [],
      "include_colab_link": true
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}